Catalogs/упТранспортныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>упТранспортныеСредства</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.упМоделиТС</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическиОпределятьКонечныйОстатокТопливаПоДаннымДатчиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиОпределятьКонечныйПробегПоДаннымДатчиков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПодбиратьВозвращениеВГаражВРейсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтоматическиПодбиратьГаражВРейсе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упВидыТранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВторойОсновнойВодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Высота</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Календари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоподъемность</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатчикУровняТоплива</Name>
					<Comment>Используется для автоматического заполнения путевого листа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.упДатчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоступныеЗоны</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаДоступностиГеографическихЗон</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретитьФиксироватьДанныеОМестоположенииСМобильногоКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзображениеПрисоединенныйФайл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредстваПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упКатегорииТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЗагрузочныхМетров</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЗагрузочныхМетров</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоМест</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПосадочныхМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упМоделиТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДвигателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКузова</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Объем</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойВодитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойЭкспедитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетНеобходимыхДокументов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПакетыДокументовТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерерывМеждуРейсами</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВремяРаботы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатнаяФормаПутевогоЛиста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>cfg:EnumRef.упТипыПечатныхФормПутевогоЛиста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьНаличиеУстановленныхТрекеровКромеМобильногоКлиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрационныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнаряженнаяМасса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Масса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственноеТранспортноеСредство</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильЛиний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиЛиний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтильМаркера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упСтилиМаркеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетчикМоточасов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТемпературныйРежим</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТемпературныеРежимы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКузова</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыКузововТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТипыТС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидГСМОсновной</Name>
					<Comment>Используется для автоматического заполнения путевого листа</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ширина</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЛинейныеРазмеры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭкологическийКласс</Name>
					<Type>
						<v8:Type>cfg:EnumRef.упЭкологическиеКлассыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Гаражи</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Гараж</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГаражи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГаражныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Зона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упГеографическиеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДопустимыеКлассыОпасныхГрузов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КлассОпасности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упКлассыОпасности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьВидыГСМ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидГСМ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.упВидыГСМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемБака</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентИспользования</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/упДоступныеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упДоступныеТС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПравилаДоступностиРесурсов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/упИсторияПеревозчиковТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>упИсторияПеревозчиковТС</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упПартнеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.упТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/упВидыТранспорта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыТранспорта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Водный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воздушный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегковойАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрузовойАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спецтехника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автобус</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Железнодорожный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контейнер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/упТранспортныеСредства/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если Не ОбменДанными.Загрузка Тогда
		Если НЕ Ссылка.Партнер = Партнер Тогда
			ДополнительныеСвойства.Вставить("ПроизошлоИзменениеПеревозчика", Истина);
		КонецЕсли;
		
		Если Прицеп Тогда
			Если ЗначениеЗаполнено(ОсновнойВодитель) Тогда
				ОсновнойВодитель = Справочники.упСотрудники.ПустаяСсылка();
			КонецЕсли;
			Если ЗначениеЗаполнено(ВторойОсновнойВодитель) Тогда
				ВторойОсновнойВодитель = Справочники.упСотрудники.ПустаяСсылка();
			КонецЕсли;
			Если ЗначениеЗаполнено(ОсновнойЭкспедитор) Тогда
				ОсновнойЭкспедитор = Справочники.упСотрудники.ПустаяСсылка();
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтильЛиний) Тогда
				СтильЛиний = Справочники.упСтилиЛиний.ПустаяСсылка();
			КонецЕсли;		
			Если ЗначениеЗаполнено(СтильМаркера) Тогда
				СтильМаркера = Справочники.упСтилиМаркеров.ПустаяСсылка();
			КонецЕсли;
			Если ЗначениеЗаполнено(ПерерывМеждуРейсами) Тогда
				ПерерывМеждуРейсами = 0;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПечатнаяФормаПутевогоЛиста) Тогда
				ПечатнаяФормаПутевогоЛиста = Неопределено;
			КонецЕсли;
			
			УдалитьВидыГСМ.Очистить();
			
			Если ЗначениеЗаполнено(ДатчикУровняТоплива) Тогда
				ДатчикУровняТоплива = Справочники.упДатчики.ПустаяСсылка();
			КонецЕсли;		
		КонецЕсли;	
		Если Не ЗначениеЗаполнено(ДоступныеЗоны) Тогда
			ЭтотОбъект.ДоступныеЗоны = Справочники.упПравилаДоступностиГеографическихЗон.ДоступныВсеЗоны;
		КонецЕсли; 
		Если ВидТранспорта = Перечисления.упВидыТранспорта.Контейнер Тогда
			Справочники.упТранспортныеСредства.ПроверитьУникальностьРегистрационногоНомера(РегистрационныйНомер, Ссылка, Отказ);
		КонецЕсли;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	УстановитьПривилегированныйРежим(Истина);
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрСведений.упДоступныеТС");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ТранспортноеСредство", Ссылка);

	Попытка
		БлокировкаДанных.Заблокировать();
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Если Не ЗначениеЗаполнено(ТекстОшибки) Тогда 
			ТекстОшибки = ОписаниеОшибки();
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, Ссылка,,,Отказ);
		ЗаписьЖурналаРегистрации("ОшибкаБлокировки", УровеньЖурналаРегистрации.Ошибка, ,Ссылка, ТекстОшибки, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
		Отказ = Истина;
	КонецПопытки;
	
	упПравилаДоступностиРесурсов.СформироватьЗаписиДоступныеТС(Ссылка);
	
	Если ДополнительныеСвойства.Свойство("ПроизошлоИзменениеПеревозчика") И ДополнительныеСвойства.ПроизошлоИзменениеПеревозчика Тогда
		НоваяЗапись = РегистрыСведений.упИсторияПеревозчиковТС.СоздатьМенеджерЗаписи();
		НоваяЗапись.Период = ТекущаяДатаСеанса();
		НоваяЗапись.ТранспортноеСредство = Ссылка;
		НоваяЗапись.Партнер = Партнер;
		НоваяЗапись.Записать();
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.упМоделиТС") Тогда
		Высота 					= ДанныеЗаполнения.Высота;
		Длина  					= ДанныеЗаполнения.Длина;
		Ширина 					= ДанныеЗаполнения.Ширина;
		Грузоподъемность 			= ДанныеЗаполнения.Грузоподъемность;
		Объем 					= ДанныеЗаполнения.Объем;
		КоличествоМест 			= ДанныеЗаполнения.КоличествоМест;
		КоличествоЗагрузочныхМетров	= ДанныеЗаполнения.КоличествоЗагрузочныхМетров;
		СнаряженнаяМасса			= ДанныеЗаполнения.СнаряженнаяМасса;
		ТипТС 					= ДанныеЗаполнения.ТипТС;
		ТипКузова 				= ДанныеЗаполнения.ТипКузова;
		Модель                  = ДанныеЗаполнения;
		КоличествоПосадочныхМест = ДанныеЗаполнения.КоличествоПосадочныхМест;
		Если ЗначениеЗаполнено(ТипТС) Тогда
			ВидТранспорта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипТС, "ВидТранспорта");	
		КонецЕсли;

	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.упТипыТС") Тогда	
		Высота 					= ДанныеЗаполнения.Высота;
		Длина  					= ДанныеЗаполнения.Длина;
		Ширина 					= ДанныеЗаполнения.Ширина;
		Грузоподъемность 			= ДанныеЗаполнения.Грузоподъемность;
		Объем 					= ДанныеЗаполнения.Объем;
		КоличествоМест 			= ДанныеЗаполнения.КоличествоМест;
		КоличествоЗагрузочныхМетров	= ДанныеЗаполнения.КоличествоЗагрузочныхМетров;
		СнаряженнаяМасса			= ДанныеЗаполнения.СнаряженнаяМасса;
		ТипТС 					= ДанныеЗаполнения;
		КоличествоПосадочныхМест = ДанныеЗаполнения.КоличествоПосадочныхМест;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда	
		Если ДанныеЗаполнения.Свойство("ТипТС") Тогда 
			Высота 						= ДанныеЗаполнения.ТипТС.Высота;
			Грузоподъемность 			= ДанныеЗаполнения.ТипТС.Грузоподъемность;
			Длина 						= ДанныеЗаполнения.ТипТС.Длина;
			Объем 						= ДанныеЗаполнения.ТипТС.Объем;
			Ширина 						= ДанныеЗаполнения.ТипТС.Ширина;
			КоличествоМест 				= ДанныеЗаполнения.ТипТС.КоличествоМест;
			КоличествоЗагрузочныхМетров	= ДанныеЗаполнения.ТипТС.КоличествоЗагрузочныхМетров;
			КоличествоПосадочныхМест = ДанныеЗаполнения.ТипТС.КоличествоПосадочныхМест;
		КонецЕсли;	
		Если ДанныеЗаполнения.Свойство("Модель") Тогда 
			Высота 						= ДанныеЗаполнения.Модель.Высота;
			Грузоподъемность 			= ДанныеЗаполнения.Модель.Грузоподъемность;
			Длина 						= ДанныеЗаполнения.Модель.Длина;
			Объем 						= ДанныеЗаполнения.Модель.Объем;
			Ширина 						= ДанныеЗаполнения.Модель.Ширина;
			КоличествоМест 				= ДанныеЗаполнения.Модель.КоличествоМест;
			КоличествоЗагрузочныхМетров	= ДанныеЗаполнения.Модель.КоличествоЗагрузочныхМетров;
			ТипКузова 					= ДанныеЗаполнения.Модель.ТипКузова;
			ТипТС 						= ДанныеЗаполнения.Модель.ТипТС;
			КоличествоПосадочныхМест = ДанныеЗаполнения.Модель.КоличествоПосадочныхМест;
			Если ЗначениеЗаполнено(ТипТС) Тогда
				ВидТранспорта				= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипТС, "ВидТранспорта");	
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ Отказ Тогда
		РольДоступнаупРазработчик = РольДоступна("упРазработчик");
		РольДоступнаПолныеПрава = РольДоступна("ПолныеПрава");
		РольДоступнаупПеревозчик	= РольДоступна("упПеревозчик");
		Если СобственноеТранспортноеСредство Тогда
			РольДоступнаУпДобавлениеИзменениеСобственныхТранспортныхСредств = РольДоступна("упДобавлениеИзменениеСобственныхТранспортныхСредств");
			РазрешеноИзменятьСобственныеТС = РольДоступнаупРазработчик ИЛИ РольДоступнаПолныеПрава ИЛИ РольДоступнаУпДобавлениеИзменениеСобственныхТранспортныхСредств;
			Если НЕ РазрешеноИзменятьСобственныеТС Тогда
				ТекстСообщения = Нстр("ru = 'Недостаточно прав для изменения собственных транспортных средств'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, );
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"СобственноеТранспортноеСредство","Объект",Отказ);
				Событие = Нстр("ru = 'Ошибка при проверке заполнения транспортного средства'");
				ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Предупреждение,, , ТекстСообщения);    
			КонецЕсли;	
		Иначе
			РольДоступнаУпДобавлениеИзменениеТранспортныхСредств = РольДоступна("упДобавлениеИзменениеТранспортныхСредств");
			РазрешеноИзменятьНеСобственныеТС = РольДоступнаупРазработчик 
												ИЛИ РольДоступнаПолныеПрава 
												ИЛИ РольДоступнаУпДобавлениеИзменениеТранспортныхСредств
												ИЛИ РольДоступнаупПеревозчик;
			Если НЕ РазрешеноИзменятьНеСобственныеТС Тогда
				ТекстСообщения = Нстр("ru = 'Недостаточно прав для изменения не собственных транспортных средств'");
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, );
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"СобственноеТранспортноеСредство","Объект",Отказ);
				Событие = Нстр("ru = 'Ошибка при проверке заполнения транспортного средства'");
				ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Предупреждение,, , ТекстСообщения);    
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ И ЗначениеЗаполнено(Ссылка) И НЕ СобственноеТранспортноеСредство Тогда
		сткВозврат = упУчетТранспортныхСредств.УчетноеСостояниеТранспортногоСредства(Ссылка);
		Если сткВозврат.ПринятоКУчету  Тогда
			ТекстСообщения = Нстр("ru = 'Транспортное средство принято к учету документом %1. 
										|Перед снятием признака собственного транспортного средства, необходимо снять транспортное средство с учета'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения,  сткВозврат.Регистратор);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Событие = Нстр("ru = 'Ошибка при проверке заполнения транспортного средства'");
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Предупреждение,, , ТекстСообщения);    
		КонецЕсли;	
	КонецЕсли;
	
	Если ВидТранспорта = Перечисления.упВидыТранспорта.Контейнер Тогда
		ПроверяемыеРеквизиты.Добавить("РегистрационныйНомер");
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ПроверяемыеРеквизиты, "Наименование");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти 

#КонецЕсли
